open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_fsbl_regress.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_fsbl_regress.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.
 * The ASF licenses this file to you under the Apache License, Version
 * 2.0 (the "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.  See the License for the specific language governing
 * permissions and limitations under the License.
 *
 ****************************************************************************/

/* FSBL regression probe (2026-08-12).
 *
 * The custom FSBL (contest2026_294_shiqian/firmware) was changed to:
 *   - open RISAF2/RISAF3 (CPU AXI RAM0/1 = AXISRAM1/2) to every CID so the
 *     LTDC (CID0) can read the 800x480 RGB565 framebuffer that spans
 *     FLEXMEM + AXISRAM1 + AXISRAM2;
 *   - keep the LTDC module clock and the SRAM clocks alive during CPU Sleep
 *     (RCC_APB5LPENR.LTDCLPEN + RCC_MEMLPENR FLEXRAM/AXISRAM1/2).
 *
 * Because RISAF rules are global to every bus master, this probe re-checks
 * on real silicon that the widened windows did not break the other CID0
 * masters that share SRAM: DMA2D and GPDMA1 (the NPU master attributes are
 * dumped as read-only configuration evidence; NuttX has no NPU driver).
 *
 * A single real-HW run yields a full pass/fail report:
 *   1. Read-back dump of the RIF / LPENR configuration the FSBL programmed:
 *      RIMC_ATTR[DMA2D/NPU/LTDC1], RISAF2/3/7 REG0 and the intentionally
 *      disabled RISAF4/5/6 REG0, GPDMA1 channel-0 CCIDCFGR, and the RCC
 *      APB5LPENR / MEMLPENR status registers.
 *   2. RIMC_ATTR[DMA2D] writability check (a 0 write must stick), so the
 *      CID sweep in step 3 is meaningful.
 *   3. DMA2D register-to-memory fill sweeping every CID 0..7 (secure+priv)
 *      into the static SRAM buffer, then -- with the first working CID --
 *      into the heap buffer offsets that land in AXISRAM1/AXISRAM2.
 *   4. Explicit REG1 experiment: because every CID write was dropped on
 *      2026-08-12 despite REG0 reading back fully open, program explicit
 *      RISAF2/3 REG1 windows and re-run the DMA2D write to test whether
 *      writes require an explicit STARTR/ENDR region rather than REG0.
 *   5. GPDMA1 memory-to-memory copy through the existing stm32n6_dma API,
 *      source in FLEXMEM, destination in the heap (AXISRAM), verifying the
 *      copied data is byte-correct.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <errno.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/cache.h>
#include <nuttx/kmalloc.h>

#include "arm_internal.h"
#include "stm32n6_dma.h"
#include "hardware/stm32_dma2d.h"
#include "hardware/stm32_memorymap.h"
#include "hardware/stm32_rcc.h"

#ifdef CONFIG_STM32_FSBL_REGRESS

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Cortex-M55 D-cache line size (ADR-007 keeps D-cache enabled). */

#define REGRESS_DCACHE_LINE    32

/* Distinctive markers: the sentinel is what the CPU writes first; the fill
 * value is what DMA2D should overwrite it with.  Neither is 0, so a dropped
 * write (leaving the sentinel) and a zeroed region are both distinguishable
 * from success.
 */

#define REGRESS_SENTINEL       0x11111111u
#define REGRESS_FILL           0x5a5aa55au

/* Bounded spin for the DMA2D flag poll. */

#define REGRESS_POLL_LIMIT     1000000u

/* R2M probe geometry: 8 ARGB8888 pixels == 32 bytes == one whole D-cache
 * line, so clean/invalidate touches only the probed buffer.
 */

#define REGRESS_PROBE_WORDS    8

/* Heap buffer for the AXISRAM probes: 1 MiB + 64 KiB so offsets 0, +512 KiB
 * and +1 MiB are all inside the allocation and span FLEXMEM / AXISRAM1 /
 * AXISRAM2 whatever the heap start address happens to be.
 */

#define REGRESS_BIG_SIZE       0x110000

/* RISAF bases (RM0486 Table 24; the NuttX memory map only exposes RISAF7).
 * Base offset from AHB3: RISAF1 +0x6000 ... RISAF7 +0xc000.
 */

#define STM32_RISAF1_BASE      (STM32_AHB3_BASE + 0x6000)
#define STM32_RISAF2_BASE      (STM32_AHB3_BASE + 0x7000)
#define STM32_RISAF3_BASE      (STM32_AHB3_BASE + 0x8000)
#define STM32_RISAF4_BASE      (STM32_AHB3_BASE + 0x9000)
#define STM32_RISAF5_BASE      (STM32_AHB3_BASE + 0xa000)
#define STM32_RISAF6_BASE      (STM32_AHB3_BASE + 0xb000)

/* RCC MEMLPENR status register (RM0486 14.10.93); the SET alias the FSBL
 * writes is at +0x800 of this offset.
 */

#define STM32_RCC_MEMLPENR     (STM32_RCC_BASE + 0x28c)

/* RIF master indices (ST HAL stm32n6xx_hal_rif.h; stm32_dma2d.h only
 * defines GPU2D=7 and DMA2D=8).
 */

#define REGRESS_MASTER_NPU     1
#define REGRESS_MASTER_LTDC1   10

/* GPDMA1 channel-0 CCIDCFGR: channel 0 register block is at +0x50 past the
 * GPDMA base (per CMSIS), CCIDCFGR is +0x04 inside the channel block.
 */

#define REGRESS_GPDMA1_CH0_CCIDCFGR  (STM32_GPDMA1_BASE + 0x54)

/* GPDMA1 CCIDCFGR bits (CMSIS DMA_CCIDCFGR): CFEN enables CID filtering,
 * SCID selects the static CID.  Static CID0 == SCID field 0.
 */

#define REGRESS_GPDMA_CCIDCFGR_CFEN  (1 << 0)

/* GPDMA1 global security registers (CMSIS DMA_TypeDef): SECCFGR @ +0x00 and
 * PRIVCFGR @ +0x04, one bit per channel.  The 2026-08-12 illegal-access
 * dump shows GPDMA1 presenting NS UNPRIV; setting these makes it SEC+PRIV.
 */

#define REGRESS_GPDMA_SECCFGR   (STM32_GPDMA1_BASE + 0x00)
#define REGRESS_GPDMA_PRIVCFGR  (STM32_GPDMA1_BASE + 0x04)

