open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_fsbl_regress.c
/* FLEXRAM write target: the LTDC framebuffer in board_bringup.c
 * (g_ltdc_fb, 800x480 RGB565), which the linker placed at 0x3405b440 on
 * 2026-08-12 -- inside FLEXRAM (RISAF7).  Writing 32 bytes here only tints
 * a few pixels and fbcolor can restore them.
 */

#define REGRESS_FB_FLEXMEM    0x3405b440u

/* RISAF illegal-access registers (CMSIS offsets). */

#define REGRESS_RISAF_IASR    0x08   /* Illegal access status */
#define REGRESS_RISAF_IACR    0x0c   /* Illegal access clear (w1c) */
#define REGRESS_RISAF_IAESR   0x20   /* IAR[0] error status detail */
#define REGRESS_RISAF_IADDR   0x24   /* IAR[0] illegal address */

/* SRAM region classification (RM0486 memory map). */

#define REGRESS_AXISRAM1_BASE  0x34080000u
#define REGRESS_AXISRAM2_BASE  0x34180000u
#define REGRESS_AXISRAM3_BASE  0x34280000u

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: regress_sram_region
 *
 * Description:
 *   Classify an SRAM address into the RISAF-protected region it falls in,
 *   for the log lines.
 *
 ****************************************************************************/

static const char *regress_sram_region(uint32_t addr)
{
  if (addr < REGRESS_AXISRAM1_BASE)
    {
      return "FLEXMEM(RISAF7)";
    }
  else if (addr < REGRESS_AXISRAM2_BASE)
    {
      return "AXISRAM1(RISAF2)";
    }
  else if (addr < REGRESS_AXISRAM3_BASE)
    {
      return "AXISRAM2(RISAF3)";
    }

  return "AXISRAM3+";
}

/****************************************************************************
 * Name: regress_risaf_reg0
 *
 * Description:
 *   Dump region 0 of one RISAF container.
 *
 ****************************************************************************/

static void regress_risaf_reg0(const char *name, uint32_t base)
{
  uint32_t reg0 = STM32_RISAF_REG(base, 0);

  syslog(LOG_INFO,
         "regress: %-6s REG0 CFGR=0x%08lx STARTR=0x%08lx "
         "ENDR=0x%08lx CIDCFGR=0x%08lx\n",
         name,
         (unsigned long)getreg32(reg0 + STM32_RISAF_REG_CFGR),
         (unsigned long)getreg32(reg0 + STM32_RISAF_REG_STARTR),
         (unsigned long)getreg32(reg0 + STM32_RISAF_REG_ENDR),
         (unsigned long)getreg32(reg0 + STM32_RISAF_REG_CIDCFGR));
}

/* RISAF instance map for the illegal-access scan. */

static const uint32_t g_regress_risaf_base[7] =
{
  STM32_RISAF1_BASE, STM32_RISAF2_BASE, STM32_RISAF3_BASE,
  STM32_RISAF4_BASE, STM32_RISAF5_BASE, STM32_RISAF6_BASE,
  STM32_RISAF7_BASE
};

static const char *g_regress_risaf_name[7] =
{
  "RISAF1", "RISAF2", "RISAF3", "RISAF4",
  "RISAF5", "RISAF6", "RISAF7"
};

#define REGRESS_NRISAF 7

/****************************************************************************
 * Name: regress_risaf_iar_clear
 *
 * Description:
 *   Clear any pending illegal-access flag on every RISAF so a following
 *   probe is the only source of a new flag.
 *
 ****************************************************************************/

static void regress_risaf_iar_clear(void)
{
  int i;

  for (i = 0; i < REGRESS_NRISAF; i++)
    {
      uint32_t iasr;

      iasr = getreg32(g_regress_risaf_base[i] + REGRESS_RISAF_IASR);
      if (iasr != 0)
        {
          putreg32(iasr, g_regress_risaf_base[i] + REGRESS_RISAF_IACR);
        }
    }
}

/****************************************************************************
 * Name: regress_risaf_iar_check
 *
 * Description:
 *   Dump every RISAF illegal-access flag (which instance, which CID,
 *   secure/priv attributes, read/write, and the illegal address), then
 *   clear the flags.  This pinpoints which RISAF rejected a DMA probe and
 *   with what access attributes -- the decisive evidence for the 2026-08-12
 *   DMA2D/GPDMA write-block finding.
 *
 ****************************************************************************/

static void regress_risaf_iar_check(const char *stage)
{
  int i;

  for (i = 0; i < REGRESS_NRISAF; i++)
    {
      uint32_t iasr;

      iasr = getreg32(g_regress_risaf_base[i] + REGRESS_RISAF_IASR);
      if (iasr != 0)
        {
          uint32_t iaesr;
          uint32_t iaddr;

          iaesr = getreg32(g_regress_risaf_base[i] + REGRESS_RISAF_IAESR);
          iaddr = getreg32(g_regress_risaf_base[i] + REGRESS_RISAF_IADDR);

          syslog(LOG_INFO,
                 "regress: %s %s ILLEGAL ACCESS IASR=0x%08lx "
                 "IAESR=0x%08lx (CID=%lu %s %s %s) IADDR=0x%08lx\n",
                 g_regress_risaf_name[i], stage,
                 (unsigned long)iasr, (unsigned long)iaesr,
                 (unsigned long)(iaesr & 0x7),
                 (iaesr & 0x20) ? "SEC" : "NS",
                 (iaesr & 0x10) ? "PRIV" : "UNPRIV",
                 (iaesr & 0x80) ? "WRITE" : "READ",
                 (unsigned long)iaddr);

          putreg32(iasr, g_regress_risaf_base[i] + REGRESS_RISAF_IACR);
        }
    }
}

/****************************************************************************
 * Name: regress_rif_dump
 *
 * Description:
 *   Read back and log the RIF / LPENR configuration the custom FSBL
 *   programmed.  Purely diagnostic; no side effects.
 *
 ****************************************************************************/

static void regress_rif_dump(void)
{
  uint32_t v;

  syslog(LOG_INFO, "regress: --- RIF / LPENR configuration read-back ---\n");

  v = getreg32(STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));
  syslog(LOG_INFO, "regress: RIMC_ATTR[DMA2D] =0x%08lx "
         "(FSBL expects 0x3 = MCID0|SEC|PRIV)\n", (unsigned long)v);

  v = getreg32(STM32_RIFSC_RIMC_ATTR(REGRESS_MASTER_NPU));
  syslog(LOG_INFO, "regress: RIMC_ATTR[NPU]   =0x%08lx "
         "(FSBL expects 0x3)\n", (unsigned long)v);

  v = getreg32(STM32_RIFSC_RIMC_ATTR(REGRESS_MASTER_LTDC1));
  syslog(LOG_INFO, "regress: RIMC_ATTR[LTDC1] =0x%08lx (info only)\n",
         (unsigned long)v);

