open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_fsbl_regress.c
  regress_risaf_reg0("RISAF1", STM32_RISAF1_BASE);
  regress_risaf_reg0("RISAF2", STM32_RISAF2_BASE);
  regress_risaf_reg0("RISAF3", STM32_RISAF3_BASE);
  regress_risaf_reg0("RISAF4", STM32_RISAF4_BASE);
  regress_risaf_reg0("RISAF5", STM32_RISAF5_BASE);
  regress_risaf_reg0("RISAF6", STM32_RISAF6_BASE);
  regress_risaf_reg0("RISAF7", STM32_RISAF7_BASE);

  /* The GPDMA1 channel registers (incl. CCIDCFGR) are RAZ/WI while the AHB1
   * peripheral clock is gated, so open the clock before reading -- a 0 then
   * means the FSBL write really never landed, not a clock artifact.  The
   * AHB1 clock gate is set through the AHB1ENSR set-alias (same as the
   * stm32n6_dma driver).
   */

  putreg32(RCC_AHB1ENR_GPDMA1EN, STM32_RCC_AHB1ENSR);

  v = getreg32(REGRESS_GPDMA1_CH0_CCIDCFGR);
  syslog(LOG_INFO, "regress: GPDMA1 ch0 CCIDCFGR =0x%08lx "
         "(FSBL expects 0x1 = static CID0 + CFEN)\n", (unsigned long)v);

  v = getreg32(STM32_RCC_APB5LPENR);
  syslog(LOG_INFO, "regress: RCC APB5LPENR  =0x%08lx "
         "(FSBL expects 0x2 = LTDCLPEN)\n", (unsigned long)v);

  v = getreg32(STM32_RCC_MEMLPENR);
  syslog(LOG_INFO, "regress: RCC MEMLPENR   =0x%08lx "
         "(FSBL expects 0x380 = FLEXRAM|AXISRAM1|AXISRAM2)\n",
         (unsigned long)v);
}

/****************************************************************************
 * Name: regress_dma2d_r2m_fill
 *
 * Description:
 *   Run one DMA2D register-to-memory fill of the known word into an
 *   arbitrary SRAM address and verify it landed.  A sentinel pre-fill
 *   (cleaned to physical SRAM) plus a post-fill D-cache invalidate tells a
 *   real DMA2D write from a dropped (RAZ/WI) firewalled write.
 *
 ****************************************************************************/

static int regress_dma2d_r2m_fill(uint32_t *target, uint32_t words)
{
  uint32_t isr;
  uint32_t count;
  int      i;

  for (i = 0; i < words; i++)
    {
      target[i] = REGRESS_SENTINEL;
    }

  up_clean_dcache((uintptr_t)target,
                  (uintptr_t)target + words * sizeof(uint32_t));

  putreg32(DMA2D_IFCR_CTEIF | DMA2D_IFCR_CTCIF | DMA2D_IFCR_CCEIF,
           STM32_DMA2D_IFCR);
  putreg32(DMA2D_OPFCCR_CM_ARGB8888, STM32_DMA2D_OPFCCR);
  putreg32(REGRESS_FILL, STM32_DMA2D_OCOLR);
  putreg32((uint32_t)(uintptr_t)target, STM32_DMA2D_OMAR);
  putreg32(0, STM32_DMA2D_OOR);
  putreg32((words << DMA2D_NLR_PL_SHIFT) | (1 << DMA2D_NLR_NL_SHIFT),
           STM32_DMA2D_NLR);
  putreg32(DMA2D_CR_MODE_R2M | DMA2D_CR_START, STM32_DMA2D_CR);

  count = 0;
  do
    {
      isr = getreg32(STM32_DMA2D_ISR);
      if (++count > REGRESS_POLL_LIMIT)
        {
          return -ETIMEDOUT;
        }
    }
  while ((isr & (DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF)) == 0);

  if ((isr & (DMA2D_ISR_TEIF | DMA2D_ISR_CEIF)) != 0)
    {
      return -EIO;
    }

  up_invalidate_dcache((uintptr_t)target,
                       (uintptr_t)target + words * sizeof(uint32_t));

  for (i = 0; i < words; i++)
    {
      if (target[i] != REGRESS_FILL)
        {
          return -EFAULT;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: regress_dma2d_log
 *
 * Description:
 *   Log one DMA2D probe result with its region classification.
 *
 ****************************************************************************/

static void regress_dma2d_log(const char *region, uint32_t addr, int r)
{
  const char *what;

  if (r == OK)
    {
      what = "write landed";
    }
  else if (r == -EFAULT)
    {
      what = "DROPPED (firewalled)";
    }
  else if (r == -ETIMEDOUT)
    {
      what = "timeout";
    }
  else
    {
      what = "xfer error";
    }

  syslog(LOG_INFO, "regress: DMA2D R2M %-17s @0x%08lx -> %s\n",
         region, (unsigned long)addr, what);
}

/****************************************************************************
 * Name: regress_dma2d_test
 *
 * Description:
 *   DMA2D R2M write probe.  Sweeps every compartment ID 0..7 through RIMC
 *   (secure+priv attributes, matching the FSBL configuration) and reports
 *   which CID can land a write in the static SRAM buffer.  This is the
 *   decisive experiment for the 2026-08-12 finding that DMA2D(CID0) writes
 *   to AXISRAM1 were dropped even though RISAF2/3 REG0 are read back as
 *   open-to-every-CID: if only CID1 lands the RISAF windows are still on
 *   the default rule, if a low CID lands the FSBL grant works, if every
 *   CID is dropped DMA2D is isolated somewhere else (RIFSC master rules).
 *   With the first working CID it then probes the heap buffer offsets that
 *   land in AXISRAM1/AXISRAM2 (RISAF2/3).
 *
 ****************************************************************************/

static int regress_dma2d_test(void)
{
  static uint32_t g_regress_flexmem[REGRESS_PROBE_WORDS]
    aligned_data(REGRESS_DCACHE_LINE);
  uint32_t rimc_before;
  uint32_t *big;
  uint32_t *probe;
  int       found = -1;
  int       ret = OK;
  int       r;
  int       cid;

  syslog(LOG_INFO,
         "regress: --- DMA2D R2M write probe (CID sweep 0..7) ---\n");

  modifyreg32(STM32_RCC_AHB5ENR, 0, RCC_AHB5ENR_DMA2DEN);

  rimc_before = getreg32(STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

  for (cid = 0; cid <= 7; cid++)
    {
      putreg32(RIFSC_RIMC_ATTR_MCID(cid) | RIFSC_RIMC_ATTR_MSEC |
               RIFSC_RIMC_ATTR_MPRIV,
               STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

      r = regress_dma2d_r2m_fill(g_regress_flexmem, REGRESS_PROBE_WORDS);
      syslog(LOG_INFO, "regress: DMA2D CID%d %-17s @0x%08lx -> %s\n",
             cid,
             regress_sram_region((uint32_t)(uintptr_t)g_regress_flexmem),
             (unsigned long)(uintptr_t)g_regress_flexmem,
             r == OK       ? "write landed" :
             r == -EFAULT  ? "DROPPED (firewalled)" :
             r == -ETIMEDOUT ? "timeout" : "xfer error");

      if (r == OK)
        {
          found = cid;
          break;
        }
    }

  putreg32(rimc_before, STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

  if (found < 0)
    {
      /* Every CID was dropped on AXISRAM1.  Distinguish "DMA2D writes are
       * blocked everywhere" from "AXISRAM1/2 specifically rejects writes"
       * by probing FLEXRAM (RISAF7) using the framebuffer, which CPU and
       * LTDC both access freely.
       */

      putreg32(RIFSC_RIMC_ATTR_MCID(0) | RIFSC_RIMC_ATTR_MSEC |
               RIFSC_RIMC_ATTR_MPRIV,
               STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

      r = regress_dma2d_r2m_fill((uint32_t *)REGRESS_FB_FLEXMEM,
                                 REGRESS_PROBE_WORDS);
      syslog(LOG_INFO, "regress: DMA2D CID0 FLEXMEM(RISAF7) fb "
             "@0x%08lx -> %s\n",
             (unsigned long)REGRESS_FB_FLEXMEM,
             r == OK       ? "write landed" :
             r == -EFAULT  ? "DROPPED (firewalled)" :
             r == -ETIMEDOUT ? "timeout" : "xfer error");

