open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_fsbl_regress.c
      putreg32(rimc_before,
               STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

      syslog(LOG_ERR, "regress: DMA2D: every CID 0..7 was firewalled\n");
      return -EFAULT;
    }

  syslog(LOG_INFO, "regress: DMA2D: CID %d lands writes; probing AXISRAM\n",
         found);

  /* Heap buffer spanning FLEXMEM / AXISRAM1 / AXISRAM2: probe three
   * offsets 512 KiB apart and report the region each absolute address
   * falls into.  kmm_memalign(32) keeps the probes cache-line aligned so
   * clean/invalidate never touches neighbouring heap metadata.
   */

  big = kmm_memalign(REGRESS_DCACHE_LINE, REGRESS_BIG_SIZE);
  if (big == NULL)
    {
      syslog(LOG_ERR, "regress: kmm_memalign(32, 0x%x) failed\n",
             REGRESS_BIG_SIZE);
      return OK;
    }

  putreg32(RIFSC_RIMC_ATTR_MCID(found) | RIFSC_RIMC_ATTR_MSEC |
           RIFSC_RIMC_ATTR_MPRIV,
           STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

  probe = big;
  r = regress_dma2d_r2m_fill(probe, REGRESS_PROBE_WORDS);
  regress_dma2d_log(regress_sram_region((uint32_t)(uintptr_t)probe),
                    (uint32_t)(uintptr_t)probe, r);
  if (r != OK)
    {
      ret = r;
    }

  probe = (uint32_t *)((uintptr_t)big + 0x80000);
  r = regress_dma2d_r2m_fill(probe, REGRESS_PROBE_WORDS);
  regress_dma2d_log(regress_sram_region((uint32_t)(uintptr_t)probe),
                    (uint32_t)(uintptr_t)probe, r);
  if (r != OK)
    {
      ret = r;
    }

  probe = (uint32_t *)((uintptr_t)big + 0x100000);
  r = regress_dma2d_r2m_fill(probe, REGRESS_PROBE_WORDS);
  regress_dma2d_log(regress_sram_region((uint32_t)(uintptr_t)probe),
                    (uint32_t)(uintptr_t)probe, r);
  if (r != OK)
    {
      ret = r;
    }

  kmm_free(big);
  putreg32(rimc_before, STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));
  return ret;
}

/****************************************************************************
 * Name: regress_gpdma_test
 *
 * Description:
 *   GPDMA1 memory-to-memory copy through the existing stm32n6_dma driver
 *   API: source in FLEXMEM, destination in the heap (AXISRAM).  Verifies
 *   the copied data is byte-correct after a D-cache invalidate.
 *
 ****************************************************************************/

static int regress_gpdma_test(void)
{
  static const uint32_t g_regress_src[16] =
  {
    0x11111111u, 0x22222222u, 0x33333333u, 0x44444444u,
    0x55555555u, 0x66666666u, 0x77777777u, 0x88888888u,
    0x99999999u, 0xaaaaaaaa, 0xbbbbbbbb, 0xcccccccc,
    0xdddddddd, 0xeeeeeeee, 0xffffffff, 0x00000000u
  };

  uint32_t *dst;
  int       ret = OK;
  int       r;
  int       i;

  syslog(LOG_INFO, "regress: --- GPDMA1 M2M copy probe (CID0) ---\n");

  /* The GPDMA1 channel registers (incl. CCIDCFGR) are RAZ/WI while the AHB1
   * peripheral clock is gated.  Open the clock first, then make sure the
   * channel presents static CID0 with filtering enabled -- the FSBL's write
   * of CCIDCFGR was ignored on 2026-08-12 (read back 0), most likely because
   * it ran before the GPDMA1 clock was enabled, so re-apply it here to make
   * the test deterministic.
   */

  modifyreg32(STM32_RCC_AHB5ENR, 0, RCC_AHB5ENR_DMA2DEN);
  putreg32(RCC_AHB1ENR_GPDMA1EN, STM32_RCC_AHB1ENSR);

  /* The 2026-08-12 illegal-access dump showed GPDMA1 presenting NS UNPRIV
   * CID1 (the FSBL CCIDCFGR write was ignored because the GPDMA1 clock was
   * gated).  Make the controller SEC+PRIV on every channel via SECCFGR /
   * PRIVCFGR and pin channel 0 to static CID0 -- this tests whether a
   * SEC+PRIV GPDMA can reach the secure RISAF windows (path B).
   */

  putreg32(0xffu, REGRESS_GPDMA_SECCFGR);
  putreg32(0xffu, REGRESS_GPDMA_PRIVCFGR);
  putreg32(REGRESS_GPDMA_CCIDCFGR_CFEN, REGRESS_GPDMA1_CH0_CCIDCFGR);

  dst = kmm_memalign(REGRESS_DCACHE_LINE, 64 + REGRESS_DCACHE_LINE);
  if (dst == NULL)
    {
      return -ENOMEM;
    }

  /* Push the source pattern to physical SRAM and drop stale destination
   * cache lines so the DMA write and the CPU read-back see real memory.
   * The destination is 32-byte aligned (kmm_memalign) so the invalidate
   * range never touches neighbouring heap metadata.
   */

  up_clean_dcache((uintptr_t)g_regress_src,
                  (uintptr_t)g_regress_src + sizeof(g_regress_src));
  up_invalidate_dcache((uintptr_t)dst, (uintptr_t)dst + 64);

  r = stm32n6_dma_init(0);
  if (r != OK)
    {
      ret = r;
      goto out;
    }

  r = stm32n6_dma_start(0, (uint32_t)(uintptr_t)g_regress_src,
                        (uint32_t)(uintptr_t)dst, 64);
  if (r != OK)
    {
      ret = r;
      goto out;
    }

  r = stm32n6_dma_wait(0, 1000);
  if (r != OK)
    {
      ret = r;
      goto out;
    }

  up_invalidate_dcache((uintptr_t)dst, (uintptr_t)dst + 64);

  for (i = 0; i < 16; i++)
    {
      if (dst[i] != g_regress_src[i])
        {
          ret = -EFAULT;
          break;
        }
    }

  syslog(LOG_INFO, "regress: GPDMA1 M2M %-17s dst @0x%08lx -> %s\n",
         regress_sram_region((uint32_t)(uintptr_t)dst),
         (unsigned long)(uintptr_t)dst,
         ret == OK ? "copy verified" : "COPY MISMATCH");

out:
  stm32n6_dma_deinit(0);
  kmm_free(dst);
  return ret;
}

/****************************************************************************
 * Name: regress_rimc_writable
 *
 * Description:
 *   Verify that RIMC_ATTR[DMA2D] is actually writable.  The 2026-08-12 CID
 *   sweep dropped every CID 0..7, which is only a meaningful result if the
 *   RIMC write really changed the presented CID.  Write 0 and read it back:
 *   if it sticks, the sweep was real; if it reads back 0x300 the register
 *   is read-only (or locked) and every sweep iteration presented CID0.
 *
 ****************************************************************************/

static int regress_rimc_writable(void)
{
  uint32_t before;
  uint32_t after;
  int      ret = OK;

  syslog(LOG_INFO, "regress: --- RIMC_ATTR[DMA2D] writability ---\n");

  before = getreg32(STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

  putreg32(0, STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));
  after = getreg32(STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

  putreg32(before, STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

  if (after != 0)
    {
      ret = -EIO;
    }

  syslog(LOG_INFO, "regress: RIMC_ATTR[DMA2D] before=0x%08lx "
         "after=0x%08lx -> %s\n",
         (unsigned long)before, (unsigned long)after,
         ret == OK ? "writable" : "WRITE IGNORED");
  return ret;
}

/****************************************************************************
 * Name: regress_risaf_open_region
 *
 * Description:
 *   Open one explicit RISAF region to every CID (read+write, secure,
 *   privileged).  Disable first (BREN=0), program, enable last -- the
 *   ordering the FSBL macro uses and that RM0486 requires.
 *
 ****************************************************************************/

static void regress_risaf_open_region(uint32_t base, int region,
                                      uint32_t endr)
{
  uint32_t reg = STM32_RISAF_REG(base, region);

  putreg32(0, reg + STM32_RISAF_REG_CFGR);
  putreg32(0, reg + STM32_RISAF_REG_STARTR);
  putreg32(endr, reg + STM32_RISAF_REG_ENDR);
  putreg32(0x00ff00ffu, reg + STM32_RISAF_REG_CIDCFGR);
  putreg32(0x00ff0101u, reg + STM32_RISAF_REG_CFGR);
}

/****************************************************************************
 * Name: regress_risaf_open_ns_region
 *
 * Description:
 *   Open one explicit RISAF region to every CID with SEC=0 (a non-secure
 *   region).  The 2026-08-12 illegal-access dump proved DMA2D/GPDMA present
 *   NS transactions regardless of RIMC MSEC, so a secure (SEC=1) region can
 *   never admit them; a non-secure region may.  This is the experiment that
 *   decides whether the fix is "make the regions non-secure" (path A).
 *
 ****************************************************************************/

static void regress_risaf_open_ns_region(uint32_t base, int region,
                                         uint32_t endr)
{
  uint32_t reg = STM32_RISAF_REG(base, region);

  putreg32(0, reg + STM32_RISAF_REG_CFGR);
  putreg32(0, reg + STM32_RISAF_REG_STARTR);
  putreg32(endr, reg + STM32_RISAF_REG_ENDR);
  putreg32(0x00ff00ffu, reg + STM32_RISAF_REG_CIDCFGR);
  putreg32(0x00ff0001u, reg + STM32_RISAF_REG_CFGR);  /* BREN|PRIVC, SEC=0 */
}

/****************************************************************************
 * Name: regress_region1_test
 *
 * Description:
 *   Decisive experiment for the 2026-08-12 finding that DMA2D/GPDMA writes
 *   to AXISRAM1/2 are dropped even though RISAF2/3 REG0 read back fully
 *   open: the illegal-access dump showed the masters present NS
 *   transactions, so a secure region rejects them regardless of CID or
 *   REG0/REG1.  Here REG1 is programmed as a NON-SECURE (SEC=0) window
 *   over AXISRAM1/2 and the DMA2D write is re-run: landed => the fix is to
 *   open non-secure windows (path A); still dropped => the write path is
 *   blocked elsewhere.  The LTDC keeps reading the framebuffer through
 *   REG0 (SEC=1) the whole time, so a still-visible LCD proves a secure
 *   master can also keep working beside the NS window.
 *
 ****************************************************************************/

