open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_fsbl_regress.c
static int regress_region1_test(void)
{
  static uint32_t g_regress_r1[REGRESS_PROBE_WORDS]
    aligned_data(REGRESS_DCACHE_LINE);
  uint32_t rimc_before;
  int      ret = OK;
  int      r;

  syslog(LOG_INFO,
         "regress: --- RISAF explicit REG1 NS-window experiment ---\n");

  rimc_before = getreg32(STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));
  putreg32(RIFSC_RIMC_ATTR_MCID(0) | RIFSC_RIMC_ATTR_MSEC |
           RIFSC_RIMC_ATTR_MPRIV,
           STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));

  /* Baseline with the FSBL configuration (secure REG0 only). */

  r = regress_dma2d_r2m_fill(g_regress_r1, REGRESS_PROBE_WORDS);
  syslog(LOG_INFO, "regress: REG1 baseline CID0 %-17s @0x%08lx -> %s\n",
         regress_sram_region((uint32_t)(uintptr_t)g_regress_r1),
         (unsigned long)(uintptr_t)g_regress_r1,
         r == OK ? "write landed" : "DROPPED (firewalled)");

  /* Open NON-SECURE REG1 windows over AXISRAM1/2 (SEC=0). */

  regress_risaf_open_ns_region(STM32_RISAF2_BASE, 1, 0x000fffff);
  regress_risaf_open_ns_region(STM32_RISAF3_BASE, 1, 0x000fffff);

  r = regress_dma2d_r2m_fill(g_regress_r1, REGRESS_PROBE_WORDS);
  syslog(LOG_INFO, "regress: REG1 NS-opened CID0 %-17s @0x%08lx -> %s\n",
         regress_sram_region((uint32_t)(uintptr_t)g_regress_r1),
         (unsigned long)(uintptr_t)g_regress_r1,
         r == OK ? "write landed" : "DROPPED (firewalled)");
  if (r != OK)
    {
      ret = r;
    }

  syslog(LOG_INFO,
         "regress: NOTE: LCD still visible after NS REG1 => secure LTDC "
         "reads still pass beside the NS window\n");

  /* Restore: disable REG1 (BREN off), REG0 stays as the FSBL left it. */

  putreg32(0, STM32_RISAF_REG(STM32_RISAF2_BASE, 1) + STM32_RISAF_REG_CFGR);
  putreg32(0, STM32_RISAF_REG(STM32_RISAF3_BASE, 1) + STM32_RISAF_REG_CFGR);

  putreg32(rimc_before, STM32_RIFSC_RIMC_ATTR(RIF_MASTER_INDEX_DMA2D));
  return ret;
}

/****************************************************************************
 * Name: regress_word_landed
 *
 * Description:
 *   Probe one word: is the address writable by the CPU?  Cache maintenance
 *   brackets the access so a D-Cache hit can never masquerade as a landed
 *   write.  A RIF-denied write is silently discarded and reads back as
 *   zero -- the 2026-09-11 observation that proved the NuttX heap was
 *   extending into memory the CPU cannot write.
 *
 ****************************************************************************/

static int regress_word_landed(uint32_t addr)
{
  FAR volatile uint32_t *p = (FAR volatile uint32_t *)(uintptr_t)addr;
  uint32_t pattern = 0x5a5a0000u | ((addr >> 16) & 0xffffu);

  up_invalidate_dcache((uintptr_t)addr, (uintptr_t)addr + sizeof(uint32_t));
  *p = pattern;
  up_clean_dcache((uintptr_t)addr, (uintptr_t)addr + sizeof(uint32_t));
  up_invalidate_dcache((uintptr_t)addr, (uintptr_t)addr + sizeof(uint32_t));

  return *p == pattern ? OK : -EFAULT;
}

/****************************************************************************
 * Name: regress_ram_window_test
 *
 * Description:
 *   Measure which parts of the 0x34200000-0x34400000 window (SRAM3..SRAM6,
 *   which RM0486 Table 24 calls "the 2-Mbyte NPU RAM", plus CACHEAXI RAM)
 *   the CPU can actually write.  RISAF4/5/6 protect the NPU RAM and reset
 *   to "secure, privileged, CID = 1 only" (RM0486 7.4.3), so the CPU is
 *   expected to be denied until those regions are opened.
 *
 *   Every probed address must be ABOVE the heap end, otherwise the probe
 *   would overwrite live heap bookkeeping.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: regress_npuram_gates_dump
 *
 * Description:
 *   Read back every gate that stands between the CPU and the NPU RAM
 *   (AXISRAM3..6, 0x34200000-0x343C0000):
 *
 *     RCC_MEMENR   reset value 0x000013F0 -> AXISRAM3..6EN (bits 0..3)
 *                  are CLEAR, the CPU must set them (RM0486 14.10.78)
 *     RCC_MEMRSTR  per-bank reset bits (RM0486 14.10.63)
 *     RCC_BUSENR   ACLKNEN gates ck_icn_npu; with it off the CPU cannot
 *                  access AXISRAM3/4/5/6 at all (RM0486 14.4)
 *     SYSCFG_NPU_ICNCR  INTERLEAVING_ACTIVE (RM0486 16.1.21)
 *     RISAF4/5/6 REG0   the RIF view of the NPU RAM
 *
 ****************************************************************************/

#define REGRESS_SYSCFG_NPU_ICNCR (STM32_SYSCFG_BASE + 0x78)

static void regress_npuram_gates_dump(void)
{
  uint32_t memenr = getreg32(STM32_RCC_MEMENR);
  uint32_t rstr   = getreg32(STM32_RCC_MEMRSTR);
  uint32_t busenr = getreg32(STM32_RCC_BUSENR);
  uint32_t icncr  = getreg32(REGRESS_SYSCFG_NPU_ICNCR);

  syslog(LOG_INFO, "regress: --- NPU RAM (AXISRAM3..6) gate state ---\n");
  syslog(LOG_INFO,
         "regress: RCC MEMENR =0x%08lx AXISRAM3..6EN=%d%d%d%d "
         "CACHEAXIRAMEN=%d FLEXRAMEN=%d AXISRAM1/2EN=%d%d\n",
         (unsigned long)memenr,
         (int)((memenr >> 0) & 1u), (int)((memenr >> 1) & 1u),
         (int)((memenr >> 2) & 1u), (int)((memenr >> 3) & 1u),
         (int)((memenr >> 10) & 1u), (int)((memenr >> 9) & 1u),
         (int)((memenr >> 7) & 1u), (int)((memenr >> 8) & 1u));
  syslog(LOG_INFO,
         "regress: RCC MEMRSTR=0x%08lx AXISRAM3..6RST=%d%d%d%d\n",
         (unsigned long)rstr,
         (int)((rstr >> 0) & 1u), (int)((rstr >> 1) & 1u),
         (int)((rstr >> 2) & 1u), (int)((rstr >> 3) & 1u));
  syslog(LOG_INFO,
         "regress: RCC BUSENR =0x%08lx ACLKNEN=%d ACLKNCEN=%d\n",
         (unsigned long)busenr,
         (int)((busenr >> 0) & 1u), (int)((busenr >> 1) & 1u));
  syslog(LOG_INFO,
         "regress: SYSCFG NPU_ICNCR=0x%08lx INTERLEAVING_ACTIVE=%d\n",
         (unsigned long)icncr, (int)(icncr & 1u));
  syslog(LOG_INFO, "regress: RCC AHB2ENR =0x%08lx RAMCFGEN=%d\n",
         (unsigned long)getreg32(STM32_RCC_AHB2ENR),
         (int)((getreg32(STM32_RCC_AHB2ENR) >> 12) & 1u));

  /* RAMCFG shutdown state.  RM0486 10.3: a RAM in shutdown ignores writes
   * and reads back zero -- the exact 2026-09-11 symptom.
   */

  syslog(LOG_INFO,
         "regress: RAMCFG SRAM3/4/5/6 CR=0x%08lx 0x%08lx 0x%08lx 0x%08lx "
         "SRAMSD=%d%d%d%d\n",
         (unsigned long)getreg32(STM32_RAMCFG_SRAM3_AXI),
         (unsigned long)getreg32(STM32_RAMCFG_SRAM4_AXI),
         (unsigned long)getreg32(STM32_RAMCFG_SRAM5_AXI),
         (unsigned long)getreg32(STM32_RAMCFG_SRAM6_AXI),
         (int)((getreg32(STM32_RAMCFG_SRAM3_AXI) >> 20) & 1u),
         (int)((getreg32(STM32_RAMCFG_SRAM4_AXI) >> 20) & 1u),
         (int)((getreg32(STM32_RAMCFG_SRAM5_AXI) >> 20) & 1u),
         (int)((getreg32(STM32_RAMCFG_SRAM6_AXI) >> 20) & 1u));
}

/****************************************************************************
 * Name: regress_npuram_interleave_test
 *
 * Description:
 *   Last candidate gate: SYSCFG_NPU_ICNCR.INTERLEAVING_ACTIVE.  The NPU RAM
 *   is implemented as four interleaved RAM cuts and the HAL exposes
 *   HAL_SYSCFG_EnableInterleavingCpuRam() for exactly this bit, so it is a
 *   supported operation.  Probes with the bit set, then restores it.
 *
 ****************************************************************************/

static int regress_npuram_interleave_test(void)
{
  uint32_t before = getreg32(REGRESS_SYSCFG_NPU_ICNCR);
  int      ret    = OK;

  syslog(LOG_INFO,
         "regress: --- SYSCFG NPU RAM interleaving experiment ---\n");

  putreg32(before | 1u, REGRESS_SYSCFG_NPU_ICNCR);

  syslog(LOG_INFO, "regress: NPU_ICNCR 0x%08lx -> 0x%08lx\n",
         (unsigned long)before,
         (unsigned long)getreg32(REGRESS_SYSCFG_NPU_ICNCR));

  if (regress_word_landed(0x34200000u) == OK)
    {
      syslog(LOG_INFO, "regress: SRAM3 @0x34200000 -> landed\n");
    }
  else
    {
      syslog(LOG_INFO, "regress: SRAM3 @0x34200000 -> still DROPPED\n");
      ret = -1;
    }

