open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_fsbl_regress.c
  putreg32(before, REGRESS_SYSCFG_NPU_ICNCR);
  syslog(LOG_INFO, "regress: NPU_ICNCR restored to 0x%08lx\n",
         (unsigned long)before);

  return ret;
}

static const uint32_t g_regress_ramprobe[] =
{
  0x34200000u,   /* SRAM3 (NPU RAM)  */
  0x34270000u,   /* SRAM4 (NPU RAM)  */
  0x342e0000u,   /* SRAM5 (NPU RAM)  */
  0x34350000u,   /* SRAM6 (NPU RAM)  */
  0x343c0000u,   /* CACHEAXI RAM base */
  0x343ff000u    /* CACHEAXI RAM top  */
};

static int regress_ram_window_test(void)
{
  uint32_t ahb5 = getreg32(STM32_RCC_AHB5ENR);
  int      ret  = OK;
  unsigned i;

  syslog(LOG_INFO,
         "regress: --- NPU RAM (SRAM3..6) + CACHEAXI writability ---\n");
  syslog(LOG_INFO,
         "regress: RCC AHB5ENR=0x%08lx NPUEN=%d CACHEAXIEN=%d\n",
         (unsigned long)ahb5,
         (int)((ahb5 >> 31) & 1u), (int)((ahb5 >> 30) & 1u));

  for (i = 0; i < sizeof(g_regress_ramprobe) / sizeof(g_regress_ramprobe[0]);
       i++)
    {
      uint32_t addr = g_regress_ramprobe[i];
      int      r    = regress_word_landed(addr);

      syslog(LOG_INFO, "regress: RAM @0x%08lx -> %s\n",
             (unsigned long)addr,
             r == OK ? "landed" : "DROPPED (RIF-denied)");

      if (r != OK)
        {
          ret = r;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: regress_risaf_cr_dump
 *
 * Description:
 *   Read RISAF_CR of every instance.  GLOCK=1 means the boot ROM (or the
 *   secure boot chain) already locked that RISAF configuration until the
 *   next reset (RM0486 7.4.6); the FSBL's HardFault on RISAF4/5/6 writes
 *   would then be unfixable from software.
 *
 ****************************************************************************/

static void regress_risaf_cr_dump(void)
{
  int i;

  syslog(LOG_INFO, "regress: --- RISAF_CR (GLOCK bit) ---\n");

  for (i = 0; i < REGRESS_NRISAF; i++)
    {
      uint32_t cr = getreg32(g_regress_risaf_base[i]);  /* CR is offset 0 */

      syslog(LOG_INFO, "regress: %s CR=0x%08lx GLOCK=%d\n",
             g_regress_risaf_name[i], (unsigned long)cr, (int)(cr & 1u));
    }
}

/****************************************************************************
 * Name: regress_risaf6_open_test
 *
 * Description:
 *   Decisive experiment: program RISAF6 (the CPU master port to the NPU RAM)
 *   exactly the way the FSBL macro programs RISAF2/3/7 -- BREN | SEC | all
 *   CIDs, read+write, privileged -- and re-probe SRAM3/SRAM5.
 *
 *   Landed  => the 2-Mbyte NPU RAM can be handed to the CPU, and the heap
 *              may go back to 0x34400000.
 *   Faulted => the FSBL failure is reproduced with the NPU/CACHEAXI clocks
 *              already running, which rules the clock theory out.
 *
 *   Deliberately runs LAST: a HardFault takes the system down.
 *
 ****************************************************************************/

static int regress_risaf6_open_test(void)
{
  uint32_t reg0        = STM32_RISAF_REG(STM32_RISAF6_BASE, 0);
  uint32_t cfgr_before = getreg32(reg0 + STM32_RISAF_REG_CFGR);
  uint32_t endr_before = getreg32(reg0 + STM32_RISAF_REG_ENDR);
  uint32_t cid_before  = getreg32(reg0 + STM32_RISAF_REG_CIDCFGR);
  int      ret         = OK;

  syslog(LOG_INFO,
         "regress: --- RISAF6 (CPU port to NPU RAM) open experiment ---\n");
  syslog(LOG_INFO, "regress: WARNING: the register write below may "
                   "HardFault\n");

  regress_risaf_open_region(STM32_RISAF6_BASE, 0, 0x3fffffffu);

  syslog(LOG_INFO, "regress: RISAF6 REG0 CFGR 0x%08lx -> 0x%08lx\n",
         (unsigned long)cfgr_before,
         (unsigned long)getreg32(reg0 + STM32_RISAF_REG_CFGR));

  if (regress_word_landed(0x34200000u) == OK)
    {
      syslog(LOG_INFO,
             "regress: SRAM3 @0x34200000 -> landed (CPU owns NPU RAM)\n");
    }
  else
    {
      syslog(LOG_INFO, "regress: SRAM3 @0x34200000 -> still DROPPED\n");
      ret = -1;
    }

  if (regress_word_landed(0x342e0000u) == OK)
    {
      syslog(LOG_INFO, "regress: SRAM5 @0x342e0000 -> landed\n");
    }
  else
    {
      syslog(LOG_INFO, "regress: SRAM5 @0x342e0000 -> still DROPPED\n");
      ret = -1;
    }

  /* Put the region back exactly as it was found (disabled). */

  putreg32(0, reg0 + STM32_RISAF_REG_CFGR);
  putreg32(0, reg0 + STM32_RISAF_REG_STARTR);
  putreg32(endr_before, reg0 + STM32_RISAF_REG_ENDR);
  putreg32(cid_before, reg0 + STM32_RISAF_REG_CIDCFGR);
  putreg32(cfgr_before, reg0 + STM32_RISAF_REG_CFGR);

  syslog(LOG_INFO, "regress: RISAF6 restored to CFGR=0x%08lx\n",
         (unsigned long)cfgr_before);

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_fsbl_regress
 *
 * Description:
 *   Run the FSBL regression probe: RIF/LPENR configuration read-back,
 *   RIMC writability, DMA2D R2M writes into AXISRAM1/2, the explicit
 *   REG1 experiment, and a GPDMA1 M2M copy.  Logs every step; returns OK
 *   only if every probe landed.
 *
 * Returned Value:
 *   OK on success; a negated errno otherwise.
 *
 ****************************************************************************/

int stm32n6_fsbl_regress(void)
{
  int ret = OK;

  syslog(LOG_INFO,
         "regress: ===== FSBL regression: RISAF2/3 + LPENR =====\n");

  regress_rif_dump();
  regress_risaf_cr_dump();
  regress_npuram_gates_dump();

  if (regress_rimc_writable() != OK)
    {
      ret = -1;
    }

  regress_risaf_iar_clear();
  if (regress_dma2d_test() != OK)
    {
      ret = -1;
    }

  regress_risaf_iar_check("after DMA2D sweep");

  regress_risaf_iar_clear();
  if (regress_region1_test() != OK)
    {
      ret = -1;
    }

  regress_risaf_iar_check("after REG1 experiment");

  regress_risaf_iar_clear();
  if (regress_gpdma_test() != OK)
    {
      ret = -1;
    }

  regress_risaf_iar_check("after GPDMA M2M");

  regress_risaf_iar_clear();
  if (regress_ram_window_test() != OK)
    {
      ret = -1;
    }

  regress_risaf_iar_check("after NPU RAM probe");

  regress_risaf_iar_clear();
  if (regress_risaf6_open_test() != OK)
    {
      ret = -1;
    }

  regress_risaf_iar_check("after RISAF6 experiment");

  regress_risaf_iar_clear();
  if (regress_npuram_interleave_test() != OK)
    {
      ret = -1;
    }

  regress_risaf_iar_check("after interleaving experiment");

  syslog(LOG_INFO, "regress: ===== overall: %s =====\n",
         ret == OK ? "PASS" : "FAIL");

  return ret;
}

#endif /* CONFIG_STM32_FSBL_REGRESS */
